module @module {
  util.global private @__auto.constant_32_64_1_1_torch.int8 = dense_resource<__auto.constant_32_64_1_1_torch.int8> : tensor<32x64x1x1xi8>
  util.global private @__auto.constant_32_64_1_1_torch.int8$1 = dense_resource<__auto.constant_32_64_1_1_torch.int8$1> : tensor<32x64x1x1xi8>
  util.global private @__auto.constant_32_64_1_1_torch.int8$2 = dense_resource<__auto.constant_32_64_1_1_torch.int8$2> : tensor<32x64x1x1xi8>
  util.global private @__auto.constant_64_32_1_1_torch.int8 = dense_resource<__auto.constant_64_32_1_1_torch.int8> : tensor<64x32x1x1xi8>
  util.global private @__auto.constant_32_64_3_3_torch.int8 = dense_resource<__auto.constant_32_64_3_3_torch.int8> : tensor<32x64x3x3xi8>
  util.global private @__auto.constant_8_32_3_3_torch.int8 = dense_resource<__auto.constant_8_32_3_3_torch.int8> : tensor<8x32x3x3xi8>
  util.global private @__auto.constant_16_200_torch.int8 = dense_resource<__auto.constant_16_200_torch.int8> : tensor<16x200xi8>
  func.func @main(%arg0: !torch.vtensor<[1,1,11,11],f32>) -> !torch.vtensor<[1,2],f32> attributes {torch.assume_strict_symbolic_shapes} {
    %__auto.constant_32_64_1_1_torch.int8 = util.global.load @__auto.constant_32_64_1_1_torch.int8 : tensor<32x64x1x1xi8>
    %0 = torch_c.from_builtin_tensor %__auto.constant_32_64_1_1_torch.int8 : tensor<32x64x1x1xi8> -> !torch.vtensor<[32,64,1,1],si8>
    %float5.038520e-03 = torch.constant.float 0.0050385165959596634
    %int0 = torch.constant.int 0
    %int-127 = torch.constant.int -127
    %int127 = torch.constant.int 127
    %int1 = torch.constant.int 1
    %none = torch.constant.none
    %1 = torch.operator "torch.quantized_decomposed.dequantize_per_tensor"(%0, %float5.038520e-03, %int0, %int-127, %int127, %int1, %none) : (!torch.vtensor<[32,64,1,1],si8>, !torch.float, !torch.int, !torch.int, !torch.int, !torch.int, !torch.none) -> !torch.vtensor<[32,64,1,1],f32> 
    %__auto.constant_32_64_1_1_torch.int8$1 = util.global.load @__auto.constant_32_64_1_1_torch.int8$1 : tensor<32x64x1x1xi8>
    %2 = torch_c.from_builtin_tensor %__auto.constant_32_64_1_1_torch.int8$1 : tensor<32x64x1x1xi8> -> !torch.vtensor<[32,64,1,1],si8>
    %float4.156850e-03 = torch.constant.float 0.0041568498127162457
    %int0_0 = torch.constant.int 0
    %int-127_1 = torch.constant.int -127
    %int127_2 = torch.constant.int 127
    %int1_3 = torch.constant.int 1
    %none_4 = torch.constant.none
    %3 = torch.operator "torch.quantized_decomposed.dequantize_per_tensor"(%2, %float4.156850e-03, %int0_0, %int-127_1, %int127_2, %int1_3, %none_4) : (!torch.vtensor<[32,64,1,1],si8>, !torch.float, !torch.int, !torch.int, !torch.int, !torch.int, !torch.none) -> !torch.vtensor<[32,64,1,1],f32> 
    %__auto.constant_32_64_1_1_torch.int8$2 = util.global.load @__auto.constant_32_64_1_1_torch.int8$2 : tensor<32x64x1x1xi8>
    %4 = torch_c.from_builtin_tensor %__auto.constant_32_64_1_1_torch.int8$2 : tensor<32x64x1x1xi8> -> !torch.vtensor<[32,64,1,1],si8>
    %float3.560260e-03 = torch.constant.float 0.003560264129191637
    %int0_5 = torch.constant.int 0
    %int-127_6 = torch.constant.int -127
    %int127_7 = torch.constant.int 127
    %int1_8 = torch.constant.int 1
    %none_9 = torch.constant.none
    %5 = torch.operator "torch.quantized_decomposed.dequantize_per_tensor"(%4, %float3.560260e-03, %int0_5, %int-127_6, %int127_7, %int1_8, %none_9) : (!torch.vtensor<[32,64,1,1],si8>, !torch.float, !torch.int, !torch.int, !torch.int, !torch.int, !torch.none) -> !torch.vtensor<[32,64,1,1],f32> 
    %__auto.constant_64_32_1_1_torch.int8 = util.global.load @__auto.constant_64_32_1_1_torch.int8 : tensor<64x32x1x1xi8>
    %6 = torch_c.from_builtin_tensor %__auto.constant_64_32_1_1_torch.int8 : tensor<64x32x1x1xi8> -> !torch.vtensor<[64,32,1,1],si8>
    %float3.695380e-03 = torch.constant.float 0.0036953752860426903
    %int0_10 = torch.constant.int 0
    %int-127_11 = torch.constant.int -127
    %int127_12 = torch.constant.int 127
    %int1_13 = torch.constant.int 1
    %none_14 = torch.constant.none
    %7 = torch.operator "torch.quantized_decomposed.dequantize_per_tensor"(%6, %float3.695380e-03, %int0_10, %int-127_11, %int127_12, %int1_13, %none_14) : (!torch.vtensor<[64,32,1,1],si8>, !torch.float, !torch.int, !torch.int, !torch.int, !torch.int, !torch.none) -> !torch.vtensor<[64,32,1,1],f32> 
    %8 = torch.vtensor.literal(dense_resource<torch_tensor_64_1_3_3_torch.int8> : tensor<64x1x3x3xsi8>) : !torch.vtensor<[64,1,3,3],si8>
    %float5.858460e-03 = torch.constant.float 0.0058584590442478657
    %int0_15 = torch.constant.int 0
    %int-127_16 = torch.constant.int -127
    %int127_17 = torch.constant.int 127
    %int1_18 = torch.constant.int 1
    %none_19 = torch.constant.none
    %9 = torch.operator "torch.quantized_decomposed.dequantize_per_tensor"(%8, %float5.858460e-03, %int0_15, %int-127_16, %int127_17, %int1_18, %none_19) : (!torch.vtensor<[64,1,3,3],si8>, !torch.float, !torch.int, !torch.int, !torch.int, !torch.int, !torch.none) -> !torch.vtensor<[64,1,3,3],f32> 
    %__auto.constant_32_64_3_3_torch.int8 = util.global.load @__auto.constant_32_64_3_3_torch.int8 : tensor<32x64x3x3xi8>
    %10 = torch_c.from_builtin_tensor %__auto.constant_32_64_3_3_torch.int8 : tensor<32x64x3x3xi8> -> !torch.vtensor<[32,64,3,3],si8>
    %float7.264270e-03 = torch.constant.float 0.0072642741724848747
    %int0_20 = torch.constant.int 0
    %int-127_21 = torch.constant.int -127
    %int127_22 = torch.constant.int 127
    %int1_23 = torch.constant.int 1
    %none_24 = torch.constant.none
    %11 = torch.operator "torch.quantized_decomposed.dequantize_per_tensor"(%10, %float7.264270e-03, %int0_20, %int-127_21, %int127_22, %int1_23, %none_24) : (!torch.vtensor<[32,64,3,3],si8>, !torch.float, !torch.int, !torch.int, !torch.int, !torch.int, !torch.none) -> !torch.vtensor<[32,64,3,3],f32> 
    %__auto.constant_8_32_3_3_torch.int8 = util.global.load @__auto.constant_8_32_3_3_torch.int8 : tensor<8x32x3x3xi8>
    %12 = torch_c.from_builtin_tensor %__auto.constant_8_32_3_3_torch.int8 : tensor<8x32x3x3xi8> -> !torch.vtensor<[8,32,3,3],si8>
    %float6.498300e-03 = torch.constant.float 0.0064983004704117775
    %int0_25 = torch.constant.int 0
    %int-127_26 = torch.constant.int -127
    %int127_27 = torch.constant.int 127
    %int1_28 = torch.constant.int 1
    %none_29 = torch.constant.none
    %13 = torch.operator "torch.quantized_decomposed.dequantize_per_tensor"(%12, %float6.498300e-03, %int0_25, %int-127_26, %int127_27, %int1_28, %none_29) : (!torch.vtensor<[8,32,3,3],si8>, !torch.float, !torch.int, !torch.int, !torch.int, !torch.int, !torch.none) -> !torch.vtensor<[8,32,3,3],f32> 
    %__auto.constant_16_200_torch.int8 = util.global.load @__auto.constant_16_200_torch.int8 : tensor<16x200xi8>
    %14 = torch_c.from_builtin_tensor %__auto.constant_16_200_torch.int8 : tensor<16x200xi8> -> !torch.vtensor<[16,200],si8>
    %float6.593490e-03 = torch.constant.float 0.0065934923477470875
    %int0_30 = torch.constant.int 0
    %int-127_31 = torch.constant.int -127
    %int127_32 = torch.constant.int 127
    %int1_33 = torch.constant.int 1
    %none_34 = torch.constant.none
    %15 = torch.operator "torch.quantized_decomposed.dequantize_per_tensor"(%14, %float6.593490e-03, %int0_30, %int-127_31, %int127_32, %int1_33, %none_34) : (!torch.vtensor<[16,200],si8>, !torch.float, !torch.int, !torch.int, !torch.int, !torch.int, !torch.none) -> !torch.vtensor<[16,200],f32> 
    %16 = torch.vtensor.literal(dense_resource<torch_tensor_8_16_torch.int8> : tensor<8x16xsi8>) : !torch.vtensor<[8,16],si8>
    %float4.962220e-03 = torch.constant.float 0.0049622221849858761
    %int0_35 = torch.constant.int 0
    %int-127_36 = torch.constant.int -127
    %int127_37 = torch.constant.int 127
    %int1_38 = torch.constant.int 1
    %none_39 = torch.constant.none
    %17 = torch.operator "torch.quantized_decomposed.dequantize_per_tensor"(%16, %float4.962220e-03, %int0_35, %int-127_36, %int127_37, %int1_38, %none_39) : (!torch.vtensor<[8,16],si8>, !torch.float, !torch.int, !torch.int, !torch.int, !torch.int, !torch.none) -> !torch.vtensor<[8,16],f32> 
    %18 = torch.vtensor.literal(dense_resource<torch_tensor_4_8_torch.int8> : tensor<4x8xsi8>) : !torch.vtensor<[4,8],si8>
    %float4.759460e-03 = torch.constant.float 0.0047594616189599037
    %int0_40 = torch.constant.int 0
    %int-127_41 = torch.constant.int -127
    %int127_42 = torch.constant.int 127
    %int1_43 = torch.constant.int 1
    %none_44 = torch.constant.none
    %19 = torch.operator "torch.quantized_decomposed.dequantize_per_tensor"(%18, %float4.759460e-03, %int0_40, %int-127_41, %int127_42, %int1_43, %none_44) : (!torch.vtensor<[4,8],si8>, !torch.float, !torch.int, !torch.int, !torch.int, !torch.int, !torch.none) -> !torch.vtensor<[4,8],f32> 
    %20 = torch.vtensor.literal(dense_resource<torch_tensor_2_4_torch.int8> : tensor<2x4xsi8>) : !torch.vtensor<[2,4],si8>
    %float8.353110e-03 = torch.constant.float 0.0083531057462096214
    %int0_45 = torch.constant.int 0
    %int-127_46 = torch.constant.int -127
    %int127_47 = torch.constant.int 127
    %int1_48 = torch.constant.int 1
    %none_49 = torch.constant.none
    %21 = torch.operator "torch.quantized_decomposed.dequantize_per_tensor"(%20, %float8.353110e-03, %int0_45, %int-127_46, %int127_47, %int1_48, %none_49) : (!torch.vtensor<[2,4],si8>, !torch.float, !torch.int, !torch.int, !torch.int, !torch.int, !torch.none) -> !torch.vtensor<[2,4],f32> 
    %22 = torch.vtensor.literal(dense_resource<torch_tensor_2_2_torch.int8> : tensor<2x2xsi8>) : !torch.vtensor<[2,2],si8>
    %float6.360730e-03 = torch.constant.float 0.0063607310876250267
    %int0_50 = torch.constant.int 0
    %int-127_51 = torch.constant.int -127
    %int127_52 = torch.constant.int 127
    %int1_53 = torch.constant.int 1
    %none_54 = torch.constant.none
    %23 = torch.operator "torch.quantized_decomposed.dequantize_per_tensor"(%22, %float6.360730e-03, %int0_50, %int-127_51, %int127_52, %int1_53, %none_54) : (!torch.vtensor<[2,2],si8>, !torch.float, !torch.int, !torch.int, !torch.int, !torch.int, !torch.none) -> !torch.vtensor<[2,2],f32> 
    %float3.919650e-03 = torch.constant.float 0.003919653594493866
    %int-128 = torch.constant.int -128
    %int-128_55 = torch.constant.int -128
    %int127_56 = torch.constant.int 127
    %int1_57 = torch.constant.int 1
    %24 = torch.operator "torch.quantized_decomposed.quantize_per_tensor"(%arg0, %float3.919650e-03, %int-128, %int-128_55, %int127_56, %int1_57) : (!torch.vtensor<[1,1,11,11],f32>, !torch.float, !torch.int, !torch.int, !torch.int, !torch.int) -> !torch.vtensor<[1,1,11,11],si8> 
    %float3.919650e-03_58 = torch.constant.float 0.003919653594493866
    %int-128_59 = torch.constant.int -128
    %int-128_60 = torch.constant.int -128
    %int127_61 = torch.constant.int 127
    %int1_62 = torch.constant.int 1
    %none_63 = torch.constant.none
    %25 = torch.operator "torch.quantized_decomposed.dequantize_per_tensor"(%24, %float3.919650e-03_58, %int-128_59, %int-128_60, %int127_61, %int1_62, %none_63) : (!torch.vtensor<[1,1,11,11],si8>, !torch.float, !torch.int, !torch.int, !torch.int, !torch.int, !torch.none) -> !torch.vtensor<[1,1,11,11],f32> 
    %26 = torch.vtensor.literal(dense_resource<torch_tensor_64_torch.float32> : tensor<64xf32>) : !torch.vtensor<[64],f32>
    %int1_64 = torch.constant.int 1
    %int1_65 = torch.constant.int 1
    %27 = torch.prim.ListConstruct %int1_64, %int1_65 : (!torch.int, !torch.int) -> !torch.list<int>
    %int0_66 = torch.constant.int 0
    %int0_67 = torch.constant.int 0
    %28 = torch.prim.ListConstruct %int0_66, %int0_67 : (!torch.int, !torch.int) -> !torch.list<int>
    %int1_68 = torch.constant.int 1
    %int1_69 = torch.constant.int 1
    %29 = torch.prim.ListConstruct %int1_68, %int1_69 : (!torch.int, !torch.int) -> !torch.list<int>
    %int1_70 = torch.constant.int 1
    %30 = torch.aten.conv2d %25, %9, %26, %27, %28, %29, %int1_70 : !torch.vtensor<[1,1,11,11],f32>, !torch.vtensor<[64,1,3,3],f32>, !torch.vtensor<[64],f32>, !torch.list<int>, !torch.list<int>, !torch.list<int>, !torch.int -> !torch.vtensor<[1,64,9,9],f32>
    %float5.043190e-03 = torch.constant.float 0.0050431941635906696
    %int74 = torch.constant.int 74
    %int-128_71 = torch.constant.int -128
    %int127_72 = torch.constant.int 127
    %int1_73 = torch.constant.int 1
    %31 = torch.operator "torch.quantized_decomposed.quantize_per_tensor"(%30, %float5.043190e-03, %int74, %int-128_71, %int127_72, %int1_73) : (!torch.vtensor<[1,64,9,9],f32>, !torch.float, !torch.int, !torch.int, !torch.int, !torch.int) -> !torch.vtensor<[1,64,9,9],si8> 
    %float5.043190e-03_74 = torch.constant.float 0.0050431941635906696
    %int74_75 = torch.constant.int 74
    %int-128_76 = torch.constant.int -128
    %int127_77 = torch.constant.int 127
    %int1_78 = torch.constant.int 1
    %none_79 = torch.constant.none
    %32 = torch.operator "torch.quantized_decomposed.dequantize_per_tensor"(%31, %float5.043190e-03_74, %int74_75, %int-128_76, %int127_77, %int1_78, %none_79) : (!torch.vtensor<[1,64,9,9],si8>, !torch.float, !torch.int, !torch.int, !torch.int, !torch.int, !torch.none) -> !torch.vtensor<[1,64,9,9],f32> 
    %float5.043190e-03_80 = torch.constant.float 0.0050431941635906696
    %int74_81 = torch.constant.int 74
    %int-128_82 = torch.constant.int -128
    %int127_83 = torch.constant.int 127
    %int1_84 = torch.constant.int 1
    %none_85 = torch.constant.none
    %33 = torch.operator "torch.quantized_decomposed.dequantize_per_tensor"(%31, %float5.043190e-03_80, %int74_81, %int-128_82, %int127_83, %int1_84, %none_85) : (!torch.vtensor<[1,64,9,9],si8>, !torch.float, !torch.int, !torch.int, !torch.int, !torch.int, !torch.none) -> !torch.vtensor<[1,64,9,9],f32> 
    %float5.043190e-03_86 = torch.constant.float 0.0050431941635906696
    %int74_87 = torch.constant.int 74
    %int-128_88 = torch.constant.int -128
    %int127_89 = torch.constant.int 127
    %int1_90 = torch.constant.int 1
    %none_91 = torch.constant.none
    %34 = torch.operator "torch.quantized_decomposed.dequantize_per_tensor"(%31, %float5.043190e-03_86, %int74_87, %int-128_88, %int127_89, %int1_90, %none_91) : (!torch.vtensor<[1,64,9,9],si8>, !torch.float, !torch.int, !torch.int, !torch.int, !torch.int, !torch.none) -> !torch.vtensor<[1,64,9,9],f32> 
    %float5.043190e-03_92 = torch.constant.float 0.0050431941635906696
    %int74_93 = torch.constant.int 74
    %int-128_94 = torch.constant.int -128
    %int127_95 = torch.constant.int 127
    %int1_96 = torch.constant.int 1
    %none_97 = torch.constant.none
    %35 = torch.operator "torch.quantized_decomposed.dequantize_per_tensor"(%31, %float5.043190e-03_92, %int74_93, %int-128_94, %int127_95, %int1_96, %none_97) : (!torch.vtensor<[1,64,9,9],si8>, !torch.float, !torch.int, !torch.int, !torch.int, !torch.int, !torch.none) -> !torch.vtensor<[1,64,9,9],f32> 
    %36 = torch.vtensor.literal(dense_resource<torch_tensor_32_torch.float32> : tensor<32xf32>) : !torch.vtensor<[32],f32>
    %int1_98 = torch.constant.int 1
    %int1_99 = torch.constant.int 1
    %37 = torch.prim.ListConstruct %int1_98, %int1_99 : (!torch.int, !torch.int) -> !torch.list<int>
    %int0_100 = torch.constant.int 0
    %int0_101 = torch.constant.int 0
    %38 = torch.prim.ListConstruct %int0_100, %int0_101 : (!torch.int, !torch.int) -> !torch.list<int>
    %int1_102 = torch.constant.int 1
    %int1_103 = torch.constant.int 1
    %39 = torch.prim.ListConstruct %int1_102, %int1_103 : (!torch.int, !torch.int) -> !torch.list<int>
    %int1_104 = torch.constant.int 1
    %40 = torch.aten.conv2d %35, %1, %36, %37, %38, %39, %int1_104 : !torch.vtensor<[1,64,9,9],f32>, !torch.vtensor<[32,64,1,1],f32>, !torch.vtensor<[32],f32>, !torch.list<int>, !torch.list<int>, !torch.list<int>, !torch.int -> !torch.vtensor<[1,32,9,9],f32>
    %float8.710760e-03 = torch.constant.float 0.0087107662111520767
    %int3 = torch.constant.int 3
    %int-128_105 = torch.constant.int -128
    %int127_106 = torch.constant.int 127
    %int1_107 = torch.constant.int 1
    %41 = torch.operator "torch.quantized_decomposed.quantize_per_tensor"(%40, %float8.710760e-03, %int3, %int-128_105, %int127_106, %int1_107) : (!torch.vtensor<[1,32,9,9],f32>, !torch.float, !torch.int, !torch.int, !torch.int, !torch.int) -> !torch.vtensor<[1,32,9,9],si8> 
    %float8.710760e-03_108 = torch.constant.float 0.0087107662111520767
    %int3_109 = torch.constant.int 3
    %int-128_110 = torch.constant.int -128
    %int127_111 = torch.constant.int 127
    %int1_112 = torch.constant.int 1
    %none_113 = torch.constant.none
    %42 = torch.operator "torch.quantized_decomposed.dequantize_per_tensor"(%41, %float8.710760e-03_108, %int3_109, %int-128_110, %int127_111, %int1_112, %none_113) : (!torch.vtensor<[1,32,9,9],si8>, !torch.float, !torch.int, !torch.int, !torch.int, !torch.int, !torch.none) -> !torch.vtensor<[1,32,9,9],f32> 
    %int1_114 = torch.constant.int 1
    %int32 = torch.constant.int 32
    %int-1 = torch.constant.int -1
    %43 = torch.prim.ListConstruct %int1_114, %int32, %int-1 : (!torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %44 = torch.aten.view %42, %43 : !torch.vtensor<[1,32,9,9],f32>, !torch.list<int> -> !torch.vtensor<[1,32,81],f32>
    %float8.710760e-03_115 = torch.constant.float 0.0087107662111520767
    %int3_116 = torch.constant.int 3
    %int-128_117 = torch.constant.int -128
    %int127_118 = torch.constant.int 127
    %int1_119 = torch.constant.int 1
    %45 = torch.operator "torch.quantized_decomposed.quantize_per_tensor"(%44, %float8.710760e-03_115, %int3_116, %int-128_117, %int127_118, %int1_119) : (!torch.vtensor<[1,32,81],f32>, !torch.float, !torch.int, !torch.int, !torch.int, !torch.int) -> !torch.vtensor<[1,32,81],si8> 
    %float8.710760e-03_120 = torch.constant.float 0.0087107662111520767
    %int3_121 = torch.constant.int 3
    %int-128_122 = torch.constant.int -128
    %int127_123 = torch.constant.int 127
    %int1_124 = torch.constant.int 1
    %none_125 = torch.constant.none
    %46 = torch.operator "torch.quantized_decomposed.dequantize_per_tensor"(%45, %float8.710760e-03_120, %int3_121, %int-128_122, %int127_123, %int1_124, %none_125) : (!torch.vtensor<[1,32,81],si8>, !torch.float, !torch.int, !torch.int, !torch.int, !torch.int, !torch.none) -> !torch.vtensor<[1,32,81],f32> 
    %int0_126 = torch.constant.int 0
    %int2 = torch.constant.int 2
    %int1_127 = torch.constant.int 1
    %47 = torch.prim.ListConstruct %int0_126, %int2, %int1_127 : (!torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %48 = torch.aten.permute %46, %47 : !torch.vtensor<[1,32,81],f32>, !torch.list<int> -> !torch.vtensor<[1,81,32],f32>
    %float8.710760e-03_128 = torch.constant.float 0.0087107662111520767
    %int3_129 = torch.constant.int 3
    %int-128_130 = torch.constant.int -128
    %int127_131 = torch.constant.int 127
    %int1_132 = torch.constant.int 1
    %49 = torch.operator "torch.quantized_decomposed.quantize_per_tensor"(%48, %float8.710760e-03_128, %int3_129, %int-128_130, %int127_131, %int1_132) : (!torch.vtensor<[1,81,32],f32>, !torch.float, !torch.int, !torch.int, !torch.int, !torch.int) -> !torch.vtensor<[1,81,32],si8> 
    %float8.710760e-03_133 = torch.constant.float 0.0087107662111520767
    %int3_134 = torch.constant.int 3
    %int-128_135 = torch.constant.int -128
    %int127_136 = torch.constant.int 127
    %int1_137 = torch.constant.int 1
    %none_138 = torch.constant.none
    %50 = torch.operator "torch.quantized_decomposed.dequantize_per_tensor"(%49, %float8.710760e-03_133, %int3_134, %int-128_135, %int127_136, %int1_137, %none_138) : (!torch.vtensor<[1,81,32],si8>, !torch.float, !torch.int, !torch.int, !torch.int, !torch.int, !torch.none) -> !torch.vtensor<[1,81,32],f32> 
    %51 = torch.vtensor.literal(dense_resource<torch_tensor_32_torch.float32_1> : tensor<32xf32>) : !torch.vtensor<[32],f32>
    %int1_139 = torch.constant.int 1
    %int1_140 = torch.constant.int 1
    %52 = torch.prim.ListConstruct %int1_139, %int1_140 : (!torch.int, !torch.int) -> !torch.list<int>
    %int0_141 = torch.constant.int 0
    %int0_142 = torch.constant.int 0
    %53 = torch.prim.ListConstruct %int0_141, %int0_142 : (!torch.int, !torch.int) -> !torch.list<int>
    %int1_143 = torch.constant.int 1
    %int1_144 = torch.constant.int 1
    %54 = torch.prim.ListConstruct %int1_143, %int1_144 : (!torch.int, !torch.int) -> !torch.list<int>
    %int1_145 = torch.constant.int 1
    %55 = torch.aten.conv2d %34, %3, %51, %52, %53, %54, %int1_145 : !torch.vtensor<[1,64,9,9],f32>, !torch.vtensor<[32,64,1,1],f32>, !torch.vtensor<[32],f32>, !torch.list<int>, !torch.list<int>, !torch.list<int>, !torch.int -> !torch.vtensor<[1,32,9,9],f32>
    %float6.233150e-03 = torch.constant.float 0.0062331538647413254
    %int9 = torch.constant.int 9
    %int-128_146 = torch.constant.int -128
    %int127_147 = torch.constant.int 127
    %int1_148 = torch.constant.int 1
    %56 = torch.operator "torch.quantized_decomposed.quantize_per_tensor"(%55, %float6.233150e-03, %int9, %int-128_146, %int127_147, %int1_148) : (!torch.vtensor<[1,32,9,9],f32>, !torch.float, !torch.int, !torch.int, !torch.int, !torch.int) -> !torch.vtensor<[1,32,9,9],si8> 
    %float6.233150e-03_149 = torch.constant.float 0.0062331538647413254
    %int9_150 = torch.constant.int 9
    %int-128_151 = torch.constant.int -128
    %int127_152 = torch.constant.int 127
    %int1_153 = torch.constant.int 1
    %none_154 = torch.constant.none
    %57 = torch.operator "torch.quantized_decomposed.dequantize_per_tensor"(%56, %float6.233150e-03_149, %int9_150, %int-128_151, %int127_152, %int1_153, %none_154) : (!torch.vtensor<[1,32,9,9],si8>, !torch.float, !torch.int, !torch.int, !torch.int, !torch.int, !torch.none) -> !torch.vtensor<[1,32,9,9],f32> 
    %int1_155 = torch.constant.int 1
    %int32_156 = torch.constant.int 32
    %int-1_157 = torch.constant.int -1
    %58 = torch.prim.ListConstruct %int1_155, %int32_156, %int-1_157 : (!torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %59 = torch.aten.view %57, %58 : !torch.vtensor<[1,32,9,9],f32>, !torch.list<int> -> !torch.vtensor<[1,32,81],f32>
    %float6.233150e-03_158 = torch.constant.float 0.0062331538647413254
    %int9_159 = torch.constant.int 9
    %int-128_160 = torch.constant.int -128
    %int127_161 = torch.constant.int 127
    %int1_162 = torch.constant.int 1
    %60 = torch.operator "torch.quantized_decomposed.quantize_per_tensor"(%59, %float6.233150e-03_158, %int9_159, %int-128_160, %int127_161, %int1_162) : (!torch.vtensor<[1,32,81],f32>, !torch.float, !torch.int, !torch.int, !torch.int, !torch.int) -> !torch.vtensor<[1,32,81],si8> 
    %float6.233150e-03_163 = torch.constant.float 0.0062331538647413254
    %int9_164 = torch.constant.int 9
    %int-128_165 = torch.constant.int -128
    %int127_166 = torch.constant.int 127
    %int1_167 = torch.constant.int 1
    %none_168 = torch.constant.none
    %61 = torch.operator "torch.quantized_decomposed.dequantize_per_tensor"(%60, %float6.233150e-03_163, %int9_164, %int-128_165, %int127_166, %int1_167, %none_168) : (!torch.vtensor<[1,32,81],si8>, !torch.float, !torch.int, !torch.int, !torch.int, !torch.int, !torch.none) -> !torch.vtensor<[1,32,81],f32> 
    %62 = torch.vtensor.literal(dense_resource<torch_tensor_32_torch.float32_2> : tensor<32xf32>) : !torch.vtensor<[32],f32>
    %int1_169 = torch.constant.int 1
    %int1_170 = torch.constant.int 1
    %63 = torch.prim.ListConstruct %int1_169, %int1_170 : (!torch.int, !torch.int) -> !torch.list<int>
    %int0_171 = torch.constant.int 0
    %int0_172 = torch.constant.int 0
    %64 = torch.prim.ListConstruct %int0_171, %int0_172 : (!torch.int, !torch.int) -> !torch.list<int>
    %int1_173 = torch.constant.int 1
    %int1_174 = torch.constant.int 1
    %65 = torch.prim.ListConstruct %int1_173, %int1_174 : (!torch.int, !torch.int) -> !torch.list<int>
    %int1_175 = torch.constant.int 1
    %66 = torch.aten.conv2d %33, %5, %62, %63, %64, %65, %int1_175 : !torch.vtensor<[1,64,9,9],f32>, !torch.vtensor<[32,64,1,1],f32>, !torch.vtensor<[32],f32>, !torch.list<int>, !torch.list<int>, !torch.list<int>, !torch.int -> !torch.vtensor<[1,32,9,9],f32>
    %float6.400820e-03 = torch.constant.float 0.0064008189365267754
    %int4 = torch.constant.int 4
    %int-128_176 = torch.constant.int -128
    %int127_177 = torch.constant.int 127
    %int1_178 = torch.constant.int 1
    %67 = torch.operator "torch.quantized_decomposed.quantize_per_tensor"(%66, %float6.400820e-03, %int4, %int-128_176, %int127_177, %int1_178) : (!torch.vtensor<[1,32,9,9],f32>, !torch.float, !torch.int, !torch.int, !torch.int, !torch.int) -> !torch.vtensor<[1,32,9,9],si8> 
    %float6.400820e-03_179 = torch.constant.float 0.0064008189365267754
    %int4_180 = torch.constant.int 4
    %int-128_181 = torch.constant.int -128
    %int127_182 = torch.constant.int 127
    %int1_183 = torch.constant.int 1
    %none_184 = torch.constant.none
    %68 = torch.operator "torch.quantized_decomposed.dequantize_per_tensor"(%67, %float6.400820e-03_179, %int4_180, %int-128_181, %int127_182, %int1_183, %none_184) : (!torch.vtensor<[1,32,9,9],si8>, !torch.float, !torch.int, !torch.int, !torch.int, !torch.int, !torch.none) -> !torch.vtensor<[1,32,9,9],f32> 
    %int1_185 = torch.constant.int 1
    %int32_186 = torch.constant.int 32
    %int-1_187 = torch.constant.int -1
    %69 = torch.prim.ListConstruct %int1_185, %int32_186, %int-1_187 : (!torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %70 = torch.aten.view %68, %69 : !torch.vtensor<[1,32,9,9],f32>, !torch.list<int> -> !torch.vtensor<[1,32,81],f32>
    %float6.400820e-03_188 = torch.constant.float 0.0064008189365267754
    %int4_189 = torch.constant.int 4
    %int-128_190 = torch.constant.int -128
    %int127_191 = torch.constant.int 127
    %int1_192 = torch.constant.int 1
    %71 = torch.operator "torch.quantized_decomposed.quantize_per_tensor"(%70, %float6.400820e-03_188, %int4_189, %int-128_190, %int127_191, %int1_192) : (!torch.vtensor<[1,32,81],f32>, !torch.float, !torch.int, !torch.int, !torch.int, !torch.int) -> !torch.vtensor<[1,32,81],si8> 
    %float6.400820e-03_193 = torch.constant.float 0.0064008189365267754
    %int4_194 = torch.constant.int 4
    %int-128_195 = torch.constant.int -128
    %int127_196 = torch.constant.int 127
    %int1_197 = torch.constant.int 1
    %none_198 = torch.constant.none
    %72 = torch.operator "torch.quantized_decomposed.dequantize_per_tensor"(%71, %float6.400820e-03_193, %int4_194, %int-128_195, %int127_196, %int1_197, %none_198) : (!torch.vtensor<[1,32,81],si8>, !torch.float, !torch.int, !torch.int, !torch.int, !torch.int, !torch.none) -> !torch.vtensor<[1,32,81],f32> 
    %int0_199 = torch.constant.int 0
    %int2_200 = torch.constant.int 2
    %int1_201 = torch.constant.int 1
    %73 = torch.prim.ListConstruct %int0_199, %int2_200, %int1_201 : (!torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %74 = torch.aten.permute %72, %73 : !torch.vtensor<[1,32,81],f32>, !torch.list<int> -> !torch.vtensor<[1,81,32],f32>
    %float6.400820e-03_202 = torch.constant.float 0.0064008189365267754
    %int4_203 = torch.constant.int 4
    %int-128_204 = torch.constant.int -128
    %int127_205 = torch.constant.int 127
    %int1_206 = torch.constant.int 1
    %75 = torch.operator "torch.quantized_decomposed.quantize_per_tensor"(%74, %float6.400820e-03_202, %int4_203, %int-128_204, %int127_205, %int1_206) : (!torch.vtensor<[1,81,32],f32>, !torch.float, !torch.int, !torch.int, !torch.int, !torch.int) -> !torch.vtensor<[1,81,32],si8> 
    %float6.400820e-03_207 = torch.constant.float 0.0064008189365267754
    %int4_208 = torch.constant.int 4
    %int-128_209 = torch.constant.int -128
    %int127_210 = torch.constant.int 127
    %int1_211 = torch.constant.int 1
    %none_212 = torch.constant.none
    %76 = torch.operator "torch.quantized_decomposed.dequantize_per_tensor"(%75, %float6.400820e-03_207, %int4_208, %int-128_209, %int127_210, %int1_211, %none_212) : (!torch.vtensor<[1,81,32],si8>, !torch.float, !torch.int, !torch.int, !torch.int, !torch.int, !torch.none) -> !torch.vtensor<[1,81,32],f32> 
    %77 = torch.aten.matmul %50, %61 : !torch.vtensor<[1,81,32],f32>, !torch.vtensor<[1,32,81],f32> -> !torch.vtensor<[1,81,81],f32>
    %int-1_213 = torch.constant.int -1
    %none_214 = torch.constant.none
    %78 = torch.aten.softmax.int %77, %int-1_213, %none_214 : !torch.vtensor<[1,81,81],f32>, !torch.int, !torch.none -> !torch.vtensor<[1,81,81],f32>
    %79 = torch.aten.matmul %78, %76 : !torch.vtensor<[1,81,81],f32>, !torch.vtensor<[1,81,32],f32> -> !torch.vtensor<[1,81,32],f32>
    %int0_215 = torch.constant.int 0
    %int2_216 = torch.constant.int 2
    %int1_217 = torch.constant.int 1
    %80 = torch.prim.ListConstruct %int0_215, %int2_216, %int1_217 : (!torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %81 = torch.aten.permute %79, %80 : !torch.vtensor<[1,81,32],f32>, !torch.list<int> -> !torch.vtensor<[1,32,81],f32>
    %int1_218 = torch.constant.int 1
    %int32_219 = torch.constant.int 32
    %int9_220 = torch.constant.int 9
    %int9_221 = torch.constant.int 9
    %82 = torch.prim.ListConstruct %int1_218, %int32_219, %int9_220, %int9_221 : (!torch.int, !torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %83 = torch.aten.view %81, %82 : !torch.vtensor<[1,32,81],f32>, !torch.list<int> -> !torch.vtensor<[1,32,9,9],f32>
    %float8.638600e-04 = torch.constant.float 8.6386030307039618E-4
    %int14 = torch.constant.int 14
    %int-128_222 = torch.constant.int -128
    %int127_223 = torch.constant.int 127
    %int1_224 = torch.constant.int 1
    %84 = torch.operator "torch.quantized_decomposed.quantize_per_tensor"(%83, %float8.638600e-04, %int14, %int-128_222, %int127_223, %int1_224) : (!torch.vtensor<[1,32,9,9],f32>, !torch.float, !torch.int, !torch.int, !torch.int, !torch.int) -> !torch.vtensor<[1,32,9,9],si8> 
    %float8.638600e-04_225 = torch.constant.float 8.6386030307039618E-4
    %int14_226 = torch.constant.int 14
    %int-128_227 = torch.constant.int -128
    %int127_228 = torch.constant.int 127
    %int1_229 = torch.constant.int 1
    %none_230 = torch.constant.none
    %85 = torch.operator "torch.quantized_decomposed.dequantize_per_tensor"(%84, %float8.638600e-04_225, %int14_226, %int-128_227, %int127_228, %int1_229, %none_230) : (!torch.vtensor<[1,32,9,9],si8>, !torch.float, !torch.int, !torch.int, !torch.int, !torch.int, !torch.none) -> !torch.vtensor<[1,32,9,9],f32> 
    %86 = torch.vtensor.literal(dense_resource<torch_tensor_64_torch.float32_1> : tensor<64xf32>) : !torch.vtensor<[64],f32>
    %int1_231 = torch.constant.int 1
    %int1_232 = torch.constant.int 1
    %87 = torch.prim.ListConstruct %int1_231, %int1_232 : (!torch.int, !torch.int) -> !torch.list<int>
    %int0_233 = torch.constant.int 0
    %int0_234 = torch.constant.int 0
    %88 = torch.prim.ListConstruct %int0_233, %int0_234 : (!torch.int, !torch.int) -> !torch.list<int>
    %int1_235 = torch.constant.int 1
    %int1_236 = torch.constant.int 1
    %89 = torch.prim.ListConstruct %int1_235, %int1_236 : (!torch.int, !torch.int) -> !torch.list<int>
    %int1_237 = torch.constant.int 1
    %90 = torch.aten.conv2d %85, %7, %86, %87, %88, %89, %int1_237 : !torch.vtensor<[1,32,9,9],f32>, !torch.vtensor<[64,32,1,1],f32>, !torch.vtensor<[64],f32>, !torch.list<int>, !torch.list<int>, !torch.list<int>, !torch.int -> !torch.vtensor<[1,64,9,9],f32>
    %float1.232490e-03 = torch.constant.float 0.0012324920389801264
    %int14_238 = torch.constant.int 14
    %int-128_239 = torch.constant.int -128
    %int127_240 = torch.constant.int 127
    %int1_241 = torch.constant.int 1
    %91 = torch.operator "torch.quantized_decomposed.quantize_per_tensor"(%90, %float1.232490e-03, %int14_238, %int-128_239, %int127_240, %int1_241) : (!torch.vtensor<[1,64,9,9],f32>, !torch.float, !torch.int, !torch.int, !torch.int, !torch.int) -> !torch.vtensor<[1,64,9,9],si8> 
    %float1.232490e-03_242 = torch.constant.float 0.0012324920389801264
    %int14_243 = torch.constant.int 14
    %int-128_244 = torch.constant.int -128
    %int127_245 = torch.constant.int 127
    %int1_246 = torch.constant.int 1
    %none_247 = torch.constant.none
    %92 = torch.operator "torch.quantized_decomposed.dequantize_per_tensor"(%91, %float1.232490e-03_242, %int14_243, %int-128_244, %int127_245, %int1_246, %none_247) : (!torch.vtensor<[1,64,9,9],si8>, !torch.float, !torch.int, !torch.int, !torch.int, !torch.int, !torch.none) -> !torch.vtensor<[1,64,9,9],f32> 
    %int1_248 = torch.constant.int 1
    %93 = torch.aten.add.Tensor %92, %32, %int1_248 : !torch.vtensor<[1,64,9,9],f32>, !torch.vtensor<[1,64,9,9],f32>, !torch.int -> !torch.vtensor<[1,64,9,9],f32>
    %float5.368830e-03 = torch.constant.float 0.0053688343614339828
    %int80 = torch.constant.int 80
    %int-128_249 = torch.constant.int -128
    %int127_250 = torch.constant.int 127
    %int1_251 = torch.constant.int 1
    %94 = torch.operator "torch.quantized_decomposed.quantize_per_tensor"(%93, %float5.368830e-03, %int80, %int-128_249, %int127_250, %int1_251) : (!torch.vtensor<[1,64,9,9],f32>, !torch.float, !torch.int, !torch.int, !torch.int, !torch.int) -> !torch.vtensor<[1,64,9,9],si8> 
    %float5.368830e-03_252 = torch.constant.float 0.0053688343614339828
    %int80_253 = torch.constant.int 80
    %int-128_254 = torch.constant.int -128
    %int127_255 = torch.constant.int 127
    %int1_256 = torch.constant.int 1
    %none_257 = torch.constant.none
    %95 = torch.operator "torch.quantized_decomposed.dequantize_per_tensor"(%94, %float5.368830e-03_252, %int80_253, %int-128_254, %int127_255, %int1_256, %none_257) : (!torch.vtensor<[1,64,9,9],si8>, !torch.float, !torch.int, !torch.int, !torch.int, !torch.int, !torch.none) -> !torch.vtensor<[1,64,9,9],f32> 
    %float1.000000e-02 = torch.constant.float 1.000000e-02
    %96 = torch.aten.leaky_relu %95, %float1.000000e-02 : !torch.vtensor<[1,64,9,9],f32>, !torch.float -> !torch.vtensor<[1,64,9,9],f32>
    %float9.652620e-04 = torch.constant.float 9.6526299603283405E-4
    %int-112 = torch.constant.int -112
    %int-128_258 = torch.constant.int -128
    %int127_259 = torch.constant.int 127
    %int1_260 = torch.constant.int 1
    %97 = torch.operator "torch.quantized_decomposed.quantize_per_tensor"(%96, %float9.652620e-04, %int-112, %int-128_258, %int127_259, %int1_260) : (!torch.vtensor<[1,64,9,9],f32>, !torch.float, !torch.int, !torch.int, !torch.int, !torch.int) -> !torch.vtensor<[1,64,9,9],si8> 
    %float9.652620e-04_261 = torch.constant.float 9.6526299603283405E-4
    %int-112_262 = torch.constant.int -112
    %int-128_263 = torch.constant.int -128
    %int127_264 = torch.constant.int 127
    %int1_265 = torch.constant.int 1
    %none_266 = torch.constant.none
    %98 = torch.operator "torch.quantized_decomposed.dequantize_per_tensor"(%97, %float9.652620e-04_261, %int-112_262, %int-128_263, %int127_264, %int1_265, %none_266) : (!torch.vtensor<[1,64,9,9],si8>, !torch.float, !torch.int, !torch.int, !torch.int, !torch.int, !torch.none) -> !torch.vtensor<[1,64,9,9],f32> 
    %99 = torch.vtensor.literal(dense_resource<torch_tensor_32_torch.float32_3> : tensor<32xf32>) : !torch.vtensor<[32],f32>
    %int1_267 = torch.constant.int 1
    %int1_268 = torch.constant.int 1
    %100 = torch.prim.ListConstruct %int1_267, %int1_268 : (!torch.int, !torch.int) -> !torch.list<int>
    %int0_269 = torch.constant.int 0
    %int0_270 = torch.constant.int 0
    %101 = torch.prim.ListConstruct %int0_269, %int0_270 : (!torch.int, !torch.int) -> !torch.list<int>
    %int1_271 = torch.constant.int 1
    %int1_272 = torch.constant.int 1
    %102 = torch.prim.ListConstruct %int1_271, %int1_272 : (!torch.int, !torch.int) -> !torch.list<int>
    %int1_273 = torch.constant.int 1
    %103 = torch.aten.conv2d %98, %11, %99, %100, %101, %102, %int1_273 : !torch.vtensor<[1,64,9,9],f32>, !torch.vtensor<[32,64,3,3],f32>, !torch.vtensor<[32],f32>, !torch.list<int>, !torch.list<int>, !torch.list<int>, !torch.int -> !torch.vtensor<[1,32,7,7],f32>
    %float4.149570e-03 = torch.constant.float 0.0041495650075376034
    %int60 = torch.constant.int 60
    %int-128_274 = torch.constant.int -128
    %int127_275 = torch.constant.int 127
    %int1_276 = torch.constant.int 1
    %104 = torch.operator "torch.quantized_decomposed.quantize_per_tensor"(%103, %float4.149570e-03, %int60, %int-128_274, %int127_275, %int1_276) : (!torch.vtensor<[1,32,7,7],f32>, !torch.float, !torch.int, !torch.int, !torch.int, !torch.int) -> !torch.vtensor<[1,32,7,7],si8> 
    %float4.149570e-03_277 = torch.constant.float 0.0041495650075376034
    %int60_278 = torch.constant.int 60
    %int-128_279 = torch.constant.int -128
    %int127_280 = torch.constant.int 127
    %int1_281 = torch.constant.int 1
    %none_282 = torch.constant.none
    %105 = torch.operator "torch.quantized_decomposed.dequantize_per_tensor"(%104, %float4.149570e-03_277, %int60_278, %int-128_279, %int127_280, %int1_281, %none_282) : (!torch.vtensor<[1,32,7,7],si8>, !torch.float, !torch.int, !torch.int, !torch.int, !torch.int, !torch.none) -> !torch.vtensor<[1,32,7,7],f32> 
    %float1.000000e-02_283 = torch.constant.float 1.000000e-02
    %106 = torch.aten.leaky_relu %105, %float1.000000e-02_283 : !torch.vtensor<[1,32,7,7],f32>, !torch.float -> !torch.vtensor<[1,32,7,7],f32>
    %float1.106230e-03 = torch.constant.float 0.0011062275152653456
    %int-119 = torch.constant.int -119
    %int-128_284 = torch.constant.int -128
    %int127_285 = torch.constant.int 127
    %int1_286 = torch.constant.int 1
    %107 = torch.operator "torch.quantized_decomposed.quantize_per_tensor"(%106, %float1.106230e-03, %int-119, %int-128_284, %int127_285, %int1_286) : (!torch.vtensor<[1,32,7,7],f32>, !torch.float, !torch.int, !torch.int, !torch.int, !torch.int) -> !torch.vtensor<[1,32,7,7],si8> 
    %float1.106230e-03_287 = torch.constant.float 0.0011062275152653456
    %int-119_288 = torch.constant.int -119
    %int-128_289 = torch.constant.int -128
    %int127_290 = torch.constant.int 127
    %int1_291 = torch.constant.int 1
    %none_292 = torch.constant.none
    %108 = torch.operator "torch.quantized_decomposed.dequantize_per_tensor"(%107, %float1.106230e-03_287, %int-119_288, %int-128_289, %int127_290, %int1_291, %none_292) : (!torch.vtensor<[1,32,7,7],si8>, !torch.float, !torch.int, !torch.int, !torch.int, !torch.int, !torch.none) -> !torch.vtensor<[1,32,7,7],f32> 
    %109 = torch.vtensor.literal(dense_resource<torch_tensor_8_torch.float32> : tensor<8xf32>) : !torch.vtensor<[8],f32>
    %int1_293 = torch.constant.int 1
    %int1_294 = torch.constant.int 1
    %110 = torch.prim.ListConstruct %int1_293, %int1_294 : (!torch.int, !torch.int) -> !torch.list<int>
    %int0_295 = torch.constant.int 0
    %int0_296 = torch.constant.int 0
    %111 = torch.prim.ListConstruct %int0_295, %int0_296 : (!torch.int, !torch.int) -> !torch.list<int>
    %int1_297 = torch.constant.int 1
    %int1_298 = torch.constant.int 1
    %112 = torch.prim.ListConstruct %int1_297, %int1_298 : (!torch.int, !torch.int) -> !torch.list<int>
    %int1_299 = torch.constant.int 1
    %113 = torch.aten.conv2d %108, %13, %109, %110, %111, %112, %int1_299 : !torch.vtensor<[1,32,7,7],f32>, !torch.vtensor<[8,32,3,3],f32>, !torch.vtensor<[8],f32>, !torch.list<int>, !torch.list<int>, !torch.list<int>, !torch.int -> !torch.vtensor<[1,8,5,5],f32>
    %float2.811720e-03 = torch.constant.float 0.0028117194306105375
    %int19 = torch.constant.int 19
    %int-128_300 = torch.constant.int -128
    %int127_301 = torch.constant.int 127
    %int1_302 = torch.constant.int 1
    %114 = torch.operator "torch.quantized_decomposed.quantize_per_tensor"(%113, %float2.811720e-03, %int19, %int-128_300, %int127_301, %int1_302) : (!torch.vtensor<[1,8,5,5],f32>, !torch.float, !torch.int, !torch.int, !torch.int, !torch.int) -> !torch.vtensor<[1,8,5,5],si8> 
    %float2.811720e-03_303 = torch.constant.float 0.0028117194306105375
    %int19_304 = torch.constant.int 19
    %int-128_305 = torch.constant.int -128
    %int127_306 = torch.constant.int 127
    %int1_307 = torch.constant.int 1
    %none_308 = torch.constant.none
    %115 = torch.operator "torch.quantized_decomposed.dequantize_per_tensor"(%114, %float2.811720e-03_303, %int19_304, %int-128_305, %int127_306, %int1_307, %none_308) : (!torch.vtensor<[1,8,5,5],si8>, !torch.float, !torch.int, !torch.int, !torch.int, !torch.int, !torch.none) -> !torch.vtensor<[1,8,5,5],f32> 
    %float1.000000e-02_309 = torch.constant.float 1.000000e-02
    %116 = torch.aten.leaky_relu %115, %float1.000000e-02_309 : !torch.vtensor<[1,8,5,5],f32>, !torch.float -> !torch.vtensor<[1,8,5,5],f32>
    %int0_310 = torch.constant.int 0
    %117 = torch.aten.clone %116, %int0_310 : !torch.vtensor<[1,8,5,5],f32>, !torch.int -> !torch.vtensor<[1,8,5,5],f32>
    %int1_311 = torch.constant.int 1
    %int200 = torch.constant.int 200
    %118 = torch.prim.ListConstruct %int1_311, %int200 : (!torch.int, !torch.int) -> !torch.list<int>
    %119 = torch.aten._unsafe_view %117, %118 : !torch.vtensor<[1,8,5,5],f32>, !torch.list<int> -> !torch.vtensor<[1,200],f32>
    %float1.207510e-03 = torch.constant.float 0.0012075146660208702
    %int-124 = torch.constant.int -124
    %int-128_312 = torch.constant.int -128
    %int127_313 = torch.constant.int 127
    %int1_314 = torch.constant.int 1
    %120 = torch.operator "torch.quantized_decomposed.quantize_per_tensor"(%119, %float1.207510e-03, %int-124, %int-128_312, %int127_313, %int1_314) : (!torch.vtensor<[1,200],f32>, !torch.float, !torch.int, !torch.int, !torch.int, !torch.int) -> !torch.vtensor<[1,200],si8> 
    %float1.207510e-03_315 = torch.constant.float 0.0012075146660208702
    %int-124_316 = torch.constant.int -124
    %int-128_317 = torch.constant.int -128
    %int127_318 = torch.constant.int 127
    %int1_319 = torch.constant.int 1
    %none_320 = torch.constant.none
    %121 = torch.operator "torch.quantized_decomposed.dequantize_per_tensor"(%120, %float1.207510e-03_315, %int-124_316, %int-128_317, %int127_318, %int1_319, %none_320) : (!torch.vtensor<[1,200],si8>, !torch.float, !torch.int, !torch.int, !torch.int, !torch.int, !torch.none) -> !torch.vtensor<[1,200],f32> 
    %122 = torch.vtensor.literal(dense_resource<torch_tensor_16_torch.float32> : tensor<16xf32>) : !torch.vtensor<[16],f32>
    %123 = torch.aten.linear %121, %15, %122 : !torch.vtensor<[1,200],f32>, !torch.vtensor<[16,200],f32>, !torch.vtensor<[16],f32> -> !torch.vtensor<[1,16],f32>
    %float5.182140e-03 = torch.constant.float 0.0051821428351104259
    %int-56 = torch.constant.int -56
    %int-128_321 = torch.constant.int -128
    %int127_322 = torch.constant.int 127
    %int1_323 = torch.constant.int 1
    %124 = torch.operator "torch.quantized_decomposed.quantize_per_tensor"(%123, %float5.182140e-03, %int-56, %int-128_321, %int127_322, %int1_323) : (!torch.vtensor<[1,16],f32>, !torch.float, !torch.int, !torch.int, !torch.int, !torch.int) -> !torch.vtensor<[1,16],si8> 
    %float5.182140e-03_324 = torch.constant.float 0.0051821428351104259
    %int-56_325 = torch.constant.int -56
    %int-128_326 = torch.constant.int -128
    %int127_327 = torch.constant.int 127
    %int1_328 = torch.constant.int 1
    %none_329 = torch.constant.none
    %125 = torch.operator "torch.quantized_decomposed.dequantize_per_tensor"(%124, %float5.182140e-03_324, %int-56_325, %int-128_326, %int127_327, %int1_328, %none_329) : (!torch.vtensor<[1,16],si8>, !torch.float, !torch.int, !torch.int, !torch.int, !torch.int, !torch.none) -> !torch.vtensor<[1,16],f32> 
    %float1.000000e-02_330 = torch.constant.float 1.000000e-02
    %126 = torch.aten.leaky_relu %125, %float1.000000e-02_330 : !torch.vtensor<[1,16],f32>, !torch.float -> !torch.vtensor<[1,16],f32>
    %float3.730530e-03 = torch.constant.float 0.0037305296864360571
    %int-127_331 = torch.constant.int -127
    %int-128_332 = torch.constant.int -128
    %int127_333 = torch.constant.int 127
    %int1_334 = torch.constant.int 1
    %127 = torch.operator "torch.quantized_decomposed.quantize_per_tensor"(%126, %float3.730530e-03, %int-127_331, %int-128_332, %int127_333, %int1_334) : (!torch.vtensor<[1,16],f32>, !torch.float, !torch.int, !torch.int, !torch.int, !torch.int) -> !torch.vtensor<[1,16],si8> 
    %float3.730530e-03_335 = torch.constant.float 0.0037305296864360571
    %int-127_336 = torch.constant.int -127
    %int-128_337 = torch.constant.int -128
    %int127_338 = torch.constant.int 127
    %int1_339 = torch.constant.int 1
    %none_340 = torch.constant.none
    %128 = torch.operator "torch.quantized_decomposed.dequantize_per_tensor"(%127, %float3.730530e-03_335, %int-127_336, %int-128_337, %int127_338, %int1_339, %none_340) : (!torch.vtensor<[1,16],si8>, !torch.float, !torch.int, !torch.int, !torch.int, !torch.int, !torch.none) -> !torch.vtensor<[1,16],f32> 
    %129 = torch.vtensor.literal(dense_resource<torch_tensor_8_torch.float32_1> : tensor<8xf32>) : !torch.vtensor<[8],f32>
    %130 = torch.aten.linear %128, %17, %129 : !torch.vtensor<[1,16],f32>, !torch.vtensor<[8,16],f32>, !torch.vtensor<[8],f32> -> !torch.vtensor<[1,8],f32>
    %float8.570640e-03 = torch.constant.float 0.0085706440731883049
    %int-26 = torch.constant.int -26
    %int-128_341 = torch.constant.int -128
    %int127_342 = torch.constant.int 127
    %int1_343 = torch.constant.int 1
    %131 = torch.operator "torch.quantized_decomposed.quantize_per_tensor"(%130, %float8.570640e-03, %int-26, %int-128_341, %int127_342, %int1_343) : (!torch.vtensor<[1,8],f32>, !torch.float, !torch.int, !torch.int, !torch.int, !torch.int) -> !torch.vtensor<[1,8],si8> 
    %float8.570640e-03_344 = torch.constant.float 0.0085706440731883049
    %int-26_345 = torch.constant.int -26
    %int-128_346 = torch.constant.int -128
    %int127_347 = torch.constant.int 127
    %int1_348 = torch.constant.int 1
    %none_349 = torch.constant.none
    %132 = torch.operator "torch.quantized_decomposed.dequantize_per_tensor"(%131, %float8.570640e-03_344, %int-26_345, %int-128_346, %int127_347, %int1_348, %none_349) : (!torch.vtensor<[1,8],si8>, !torch.float, !torch.int, !torch.int, !torch.int, !torch.int, !torch.none) -> !torch.vtensor<[1,8],f32> 
    %float1.000000e-02_350 = torch.constant.float 1.000000e-02
    %133 = torch.aten.leaky_relu %132, %float1.000000e-02_350 : !torch.vtensor<[1,8],f32>, !torch.float -> !torch.vtensor<[1,8],f32>
    %float5.113440e-03 = torch.constant.float 0.0051134442910552025
    %int-126 = torch.constant.int -126
    %int-128_351 = torch.constant.int -128
    %int127_352 = torch.constant.int 127
    %int1_353 = torch.constant.int 1
    %134 = torch.operator "torch.quantized_decomposed.quantize_per_tensor"(%133, %float5.113440e-03, %int-126, %int-128_351, %int127_352, %int1_353) : (!torch.vtensor<[1,8],f32>, !torch.float, !torch.int, !torch.int, !torch.int, !torch.int) -> !torch.vtensor<[1,8],si8> 
    %float5.113440e-03_354 = torch.constant.float 0.0051134442910552025
    %int-126_355 = torch.constant.int -126
    %int-128_356 = torch.constant.int -128
    %int127_357 = torch.constant.int 127
    %int1_358 = torch.constant.int 1
    %none_359 = torch.constant.none
    %135 = torch.operator "torch.quantized_decomposed.dequantize_per_tensor"(%134, %float5.113440e-03_354, %int-126_355, %int-128_356, %int127_357, %int1_358, %none_359) : (!torch.vtensor<[1,8],si8>, !torch.float, !torch.int, !torch.int, !torch.int, !torch.int, !torch.none) -> !torch.vtensor<[1,8],f32> 
    %136 = torch.vtensor.literal(dense_resource<torch_tensor_4_torch.float32> : tensor<4xf32>) : !torch.vtensor<[4],f32>
    %137 = torch.aten.linear %135, %19, %136 : !torch.vtensor<[1,8],f32>, !torch.vtensor<[4,8],f32>, !torch.vtensor<[4],f32> -> !torch.vtensor<[1,4],f32>
    %float4.878430e-03 = torch.constant.float 0.0048784264363348484
    %int-128_360 = torch.constant.int -128
    %int-128_361 = torch.constant.int -128
    %int127_362 = torch.constant.int 127
    %int1_363 = torch.constant.int 1
    %138 = torch.operator "torch.quantized_decomposed.quantize_per_tensor"(%137, %float4.878430e-03, %int-128_360, %int-128_361, %int127_362, %int1_363) : (!torch.vtensor<[1,4],f32>, !torch.float, !torch.int, !torch.int, !torch.int, !torch.int) -> !torch.vtensor<[1,4],si8> 
    %float4.878430e-03_364 = torch.constant.float 0.0048784264363348484
    %int-128_365 = torch.constant.int -128
    %int-128_366 = torch.constant.int -128
    %int127_367 = torch.constant.int 127
    %int1_368 = torch.constant.int 1
    %none_369 = torch.constant.none
    %139 = torch.operator "torch.quantized_decomposed.dequantize_per_tensor"(%138, %float4.878430e-03_364, %int-128_365, %int-128_366, %int127_367, %int1_368, %none_369) : (!torch.vtensor<[1,4],si8>, !torch.float, !torch.int, !torch.int, !torch.int, !torch.int, !torch.none) -> !torch.vtensor<[1,4],f32> 
    %float1.000000e-02_370 = torch.constant.float 1.000000e-02
    %140 = torch.aten.leaky_relu %139, %float1.000000e-02_370 : !torch.vtensor<[1,4],f32>, !torch.float -> !torch.vtensor<[1,4],f32>
    %float4.878430e-03_371 = torch.constant.float 0.0048784264363348484
    %int-128_372 = torch.constant.int -128
    %int-128_373 = torch.constant.int -128
    %int127_374 = torch.constant.int 127
    %int1_375 = torch.constant.int 1
    %141 = torch.operator "torch.quantized_decomposed.quantize_per_tensor"(%140, %float4.878430e-03_371, %int-128_372, %int-128_373, %int127_374, %int1_375) : (!torch.vtensor<[1,4],f32>, !torch.float, !torch.int, !torch.int, !torch.int, !torch.int) -> !torch.vtensor<[1,4],si8> 
    %float4.878430e-03_376 = torch.constant.float 0.0048784264363348484
    %int-128_377 = torch.constant.int -128
    %int-128_378 = torch.constant.int -128
    %int127_379 = torch.constant.int 127
    %int1_380 = torch.constant.int 1
    %none_381 = torch.constant.none
